tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-core'
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade'

brew 'brew-cask-completion'
brew 'composer'
brew 'coreutils'
brew 'duti'
brew 'findutils', args: ['with-default-names']
brew 'gdb'
brew 'git'
brew 'glib'
brew 'lua'
brew 'mas'
brew 'mongodb'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'php71'
brew 'pipenv'
brew 'postgresql'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'swagger-codegen'
brew 'wget'
brew 'bash'
brew 'bash-completion2'
brew 'ansible'
brew 'clamav'
brew 'jmeter'
brew 'telnet'
brew 'putty'

cask '1password'
cask 'dashlane'
cask 'keybase'

cask 'alfred'
cask 'bartender'
cask 'brave-browser'
cask 'caret'
cask 'cleanmymac'
cask 'daisydisk'
cask 'virtualbox'
cask 'vagrant'
cask 'docker'
#open /Applications/Docker.app
cask 'flux'
cask 'flycut'
cask 'firefox'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'gpg-suite'
cask 'iterm2'
cask 'java8'
cask 'mattermost'
cask 'monero-wallet'
cask 'mongodb-compass'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'snip'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'teamviewer'
cask 'tigervnc-viewer'
cask 'viscosity'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'
cask 'adobe-acrobat-reader'
cask 'spectacle'
cask 'veracrypt'
cask 'libreoffice'

 #fonts
cask 'font-roboto'
cask 'font-clear-sans'

# Pay Tools
# $15
cask 'sizeup'
# $40
cask 'little-snitch'
cask 'micro-snitch'

# $40
cask 'paragon-ntfs'
# Need to run to install complete
# /usr/local/Caskroom/paragon-ntfs/15/FSInstaller.app/Contents/MacOS/FSInstaller

# $40
cask 'paragon-extfs'
# Need to run to install complete
# /usr/local/Caskroom/paragon-extfs/latest/FSInstaller.app/Contents/MacOS/FSInstaller

cask 'microsoft-office'

mas 'Amphetamine', id: 937984704
mas 'Shotty', id: 1250306151
mas 'Unclutter', id: 577085396
mas 'Xcode', id: 497799835

