tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'buo/cask-upgrade'

brew 'brew-cask-completion'
brew 'composer'
brew 'coreutils'
brew 'duti'
brew 'findutils', args: ['with-default-names']
brew 'fish'
brew 'gdb'
brew 'git'
brew 'glib'
brew 'lua'
brew 'mas'
brew 'mongodb'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'php71'
brew 'pipenv'
brew 'postgresql'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'swagger-codegen'
brew 'wget'
brew 'valgrind'

cask 'alfred'
cask 'bartender'
cask 'brave'
cask 'battle-net'
cask 'caret'
cask 'cleanmymac'
cask 'daisydisk'
cask 'dashlane'
cask 'docker'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'gpgtools'
cask 'hammerspoon'
cask 'iterm2'
cask 'java8'
cask 'karabiner-elements'
cask 'keepassx'
cask 'little-snitch'
cask 'mattermost'
cask 'microsoft-office'
cask 'micro-snitch'
cask 'monero-wallet'
cask 'mongodb-compass'
cask 'mysqlworkbench'
cask 'paragon-ntfs'
cask 'phpstorm'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'snip'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'viscosity'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'

mas 'Amphetamine', id: 937984704
mas 'Shotty', id: 1250306151
mas 'Unclutter', id: 577085396
mas 'Xcode', id: 497799835
